CFD_results/14.3mm-3out/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
80683
(
(-0.0133736871217623 0.0690458513128411 1.04212751107453)
(-0.101106149299433 0.073625364888147 1.04682428408637)
(0.0105890506596091 0.0237521853183523 1.05043306538829)
(-0.0137132446363157 -0.00814115875783961 1.08351999479897)
(0.0111571244005126 -0.0098952964803075 1.06851586685044)
(0.024641617588846 -0.0183685272381714 1.06401860581653)
(0.0443769849237328 0.00251310427619374 1.04701296790311)
(0.0405460276435525 -0.0220615764214796 1.07529321767902)
...
)
;

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 3e-05;
        extrapolateProfile false;
        value           nonuniform List<vector> 
142
(
(-0 -0 1.0679177157173)
(-0 -0 1.0679177157173)
(-0 -0 1.0679177157173)
(-0 -0 1.0679177157173)
(-0 -0 1.0679177157173)
(-0 -0 1.0679177157173)
(-0 -0 1.0679177157173)
(-0 -0 1.0679177157173)
...
)
;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
403
(
(0.177065025209359 -0.0957530458833281 -0.463702856517858)
(0.170876413371304 -0.101359571423566 -0.480741624694199)
(0.174985202969415 -0.0969672278628307 -0.419274644492837)
(0.180000542605767 -0.093591710508354 -0.431146139550764)
(0.173611417716507 -0.0319121348533838 -0.433048531080145)
(0.161398253619809 -0.0581978440288626 -0.406925828522781)
(0.142745349717437 -0.123332903758713 -0.407213001000627)
(0.118332058068604 -0.108316705015321 -0.409013249260487)
...
)
;
    }
    wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
