CFD_results/14.3mm-3out/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
229359
(
1.52929387099399e-07
3.33162729494163e-10
-1.85225352717286e-08
-2.49278414884602e-08
-1.35707278266144e-07
2.58949131104125e-08
-1.23212645502841e-07
-1.07264555956758e-07
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
142
(
-8.08810066739987e-08
-6.63798704774874e-08
-6.85195514022588e-08
-3.95313955082455e-08
-2.41937904888784e-07
-3.02970183723051e-07
-6.37722965681183e-08
-7.83952631393279e-08
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
403
(
3.46354525908523e-08
3.73264902037291e-08
8.8056028410094e-08
9.55694282362055e-08
2.22811555744644e-08
3.00037840949202e-08
6.52740038431689e-08
7.81749257212082e-08
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
